#include "scene/box.h"

namespace deft {

Box::Box(const math::Vector3& position, bool isLight)
    : SceneObject(Model::Create(
                      Mesh::Create(
                          {
                              -0.5f, -0.5f, 0.5f,  0.0f,
                              0.0f,  1.0f,  0.0f,  0.0f,  // 前
                              0.5f,  -0.5f, 0.5f,  0.0f,
                              0.0f,  1.0f,  1.0f,  0.0f,  // 前
                              0.5f,  0.5f,  0.5f,  0.0f,
                              0.0f,  1.0f,  1.0f,  1.0f,  // 前
                              -0.5f, 0.5f,  0.5f,  0.0f,
                              0.0f,  1.0f,  0.0f,  1.0f,  // 前

                              0.5f,  -0.5f, -0.5f, 0.0f,
                              0.0f,  -1.0f, 0.0f,  0.0f,  // 后
                              -0.5f, -0.5f, -0.5f, 0.0f,
                              0.0f,  -1.0f, 1.0f,  0.0f,  // 后
                              -0.5f, 0.5f,  -0.5f, 0.0f,
                              0.0f,  -1.0f, 1.0f,  1.0f,  // 后
                              0.5f,  0.5f,  -0.5f, 0.0f,
                              0.0f,  -1.0f, 0.0f,  1.0f,  // 后

                              -0.5f, -0.5f, -0.5f, -1.0f,
                              0.0f,  0.0f,  0.0f,  0.0f,  // 左
                              -0.5f, -0.5f, 0.5f,  -1.0f,
                              0.0f,  0.0f,  1.0f,  0.0f,  // 左
                              -0.5f, 0.5f,  0.5f,  -1.0f,
                              0.0f,  0.0f,  1.0f,  1.0f,  // 左
                              -0.5f, 0.5f,  -0.5f, -1.0f,
                              0.0f,  0.0f,  0.0f,  1.0f,  // 左

                              0.5f,  -0.5f, 0.5f,  1.0f,
                              0.0f,  0.0f,  0.0f,  0.0f,  // 右
                              0.5f,  -0.5f, -0.5f, 1.0f,
                              0.0f,  0.0f,  1.0f,  0.0f,  // 右
                              0.5f,  0.5f,  -0.5f, 1.0f,
                              0.0f,  0.0f,  1.0f,  1.0f,  // 右
                              0.5f,  0.5f,  0.5f,  1.0f,
                              0.0f,  0.0f,  0.0f,  1.0f,  // 右

                              -0.5f, 0.5f,  0.5f,  0.0f,
                              1.0f,  0.0f,  0.0f,  0.0f,  // 上
                              0.5f,  0.5f,  0.5f,  0.0f,
                              1.0f,  0.0f,  1.0f,  0.0f,  // 上
                              0.5f,  0.5f,  -0.5f, 0.0f,
                              1.0f,  0.0f,  1.0f,  1.0f,  // 上
                              -0.5f, 0.5f,  -0.5f, 0.0f,
                              1.0f,  0.0f,  0.0f,  1.0f,  // 上

                              -0.5f, -0.5f, -0.5f, 0.0f,
                              -1.0f, 0.0f,  0.0f,  0.0f,  // 下
                              0.5f,  -0.5f, -0.5f, 0.0f,
                              -1.0f, 0.0f,  1.0f,  0.0f,  // 下
                              0.5f,  -0.5f, 0.5f,  0.0f,
                              -1.0f, 0.0f,  1.0f,  1.0f,  // 下
                              -0.5f, -0.5f, 0.5f,  0.0f,
                              -1.0f, 0.0f,  0.0f,  1.0f,  // 下
                          },
                          {
                              {"aPos", ElementType::Float3},
                              {"aNormal", ElementType::Float3},
                              {"aTexCoord", ElementType::Float2},
                          },
                          {
                              0,  1,  2,  0,  2,  3,   //
                              4,  5,  6,  4,  6,  7,   //
                              8,  9,  10, 8,  10, 11,  //
                              12, 13, 14, 12, 14, 15,  //
                              16, 17, 18, 16, 18, 19,  //
                              20, 21, 22, 20, 22, 23,  //

                          }),
                      {Texture::Create("assets/texture/container2.png",
                                       TextureType::Diffuse),
                       Texture::Create("assets/texture/container2_specular.png",
                                       TextureType::Specular)}),
                  Transform(position), isLight) {}

Box::Box(const math::Vector3& position, const math::Vector3& color,
         bool isLight)
    : SceneObject(Model::Create(Mesh::Create(
                                    {
                                        -0.5f, -0.5f, 0.5f,  0.0f,
                                        0.0f,  1.0f,  0.0f,  0.0f,  // 前
                                        0.5f,  -0.5f, 0.5f,  0.0f,
                                        0.0f,  1.0f,  1.0f,  0.0f,  // 前
                                        0.5f,  0.5f,  0.5f,  0.0f,
                                        0.0f,  1.0f,  1.0f,  1.0f,  // 前
                                        -0.5f, 0.5f,  0.5f,  0.0f,
                                        0.0f,  1.0f,  0.0f,  1.0f,  // 前

                                        0.5f,  -0.5f, -0.5f, 0.0f,
                                        0.0f,  -1.0f, 0.0f,  0.0f,  // 后
                                        -0.5f, -0.5f, -0.5f, 0.0f,
                                        0.0f,  -1.0f, 1.0f,  0.0f,  // 后
                                        -0.5f, 0.5f,  -0.5f, 0.0f,
                                        0.0f,  -1.0f, 1.0f,  1.0f,  // 后
                                        0.5f,  0.5f,  -0.5f, 0.0f,
                                        0.0f,  -1.0f, 0.0f,  1.0f,  // 后

                                        -0.5f, -0.5f, -0.5f, -1.0f,
                                        0.0f,  0.0f,  0.0f,  0.0f,  // 左
                                        -0.5f, -0.5f, 0.5f,  -1.0f,
                                        0.0f,  0.0f,  1.0f,  0.0f,  // 左
                                        -0.5f, 0.5f,  0.5f,  -1.0f,
                                        0.0f,  0.0f,  1.0f,  1.0f,  // 左
                                        -0.5f, 0.5f,  -0.5f, -1.0f,
                                        0.0f,  0.0f,  0.0f,  1.0f,  // 左

                                        0.5f,  -0.5f, 0.5f,  1.0f,
                                        0.0f,  0.0f,  0.0f,  0.0f,  // 右
                                        0.5f,  -0.5f, -0.5f, 1.0f,
                                        0.0f,  0.0f,  1.0f,  0.0f,  // 右
                                        0.5f,  0.5f,  -0.5f, 1.0f,
                                        0.0f,  0.0f,  1.0f,  1.0f,  // 右
                                        0.5f,  0.5f,  0.5f,  1.0f,
                                        0.0f,  0.0f,  0.0f,  1.0f,  // 右

                                        -0.5f, 0.5f,  0.5f,  0.0f,
                                        1.0f,  0.0f,  0.0f,  0.0f,  // 上
                                        0.5f,  0.5f,  0.5f,  0.0f,
                                        1.0f,  0.0f,  1.0f,  0.0f,  // 上
                                        0.5f,  0.5f,  -0.5f, 0.0f,
                                        1.0f,  0.0f,  1.0f,  1.0f,  // 上
                                        -0.5f, 0.5f,  -0.5f, 0.0f,
                                        1.0f,  0.0f,  0.0f,  1.0f,  // 上

                                        -0.5f, -0.5f, -0.5f, 0.0f,
                                        -1.0f, 0.0f,  0.0f,  0.0f,  // 下
                                        0.5f,  -0.5f, -0.5f, 0.0f,
                                        -1.0f, 0.0f,  1.0f,  0.0f,  // 下
                                        0.5f,  -0.5f, 0.5f,  0.0f,
                                        -1.0f, 0.0f,  1.0f,  1.0f,  // 下
                                        -0.5f, -0.5f, 0.5f,  0.0f,
                                        -1.0f, 0.0f,  0.0f,  1.0f,  // 下
                                    },
                                    {
                                        {"aPos", ElementType::Float3},
                                        {"aNormal", ElementType::Float3},
                                        {"aTexCoord", ElementType::Float2},
                                    },
                                    {
                                        0,  1,  2,  0,  2,  3,   //
                                        4,  5,  6,  4,  6,  7,   //
                                        8,  9,  10, 8,  10, 11,  //
                                        12, 13, 14, 12, 14, 15,  //
                                        16, 17, 18, 16, 18, 19,  //
                                        20, 21, 22, 20, 22, 23,  //

                                    }),
                                Texture::Create(color)),
                  Transform(position), isLight) {}

Box::~Box() {}

}  // namespace deft
